---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.NegativeBeltDistance
source: html/cc9fca51-0b1b-da5a-1a6e-4f40cdac47f2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.NegativeBeltDistance Property

Measurement Line Offset cannot be negative.

## Syntax (C#)
```csharp
public static FailureDefinitionId NegativeBeltDistance { get; }
```